# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример:
# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1,  2,  3,  5,  8, 13, 21]
#                                            0   1   2  3   4  5   6  7  8  9  10  11  12  13  14 15  16

k = 8  # int(input())
fib = [None for i in range(k*2+1)]
fib[k] = 0
fib[k+1] = 1
fib[k-1] = 1
for i in range(k-2, -1, -1):
    fib[i] = fib[i+2]-fib[i+1]
for i in range(k+2 , k*2+1):
    fib[i] = fib[i-1]+fib[i-2]
print(fib)
